Repository: FilipeJamal/chegaja_v2
Catalog: lib/l10n/app_*.arb
Languages: pt

# providerMessageTitle
source: Provider message
pt: Mensagem do prestador

# actionEditOrder
source: Edit order
pt: Editar pedido

# actionCancelOrder
source: Cancel order
pt: Cancelar pedido

# cancelOrderTitle
source: Cancel order
pt: Cancelar pedido

# orderCancelInProgressWarning
source: The service is already in progress. Canceling now may result in a partial refund.
pt: O serviço já está em andamento. Ao cancelar agora, o reembolso pode não ser total.

# orderCancelConfirmPrompt
source: Are you sure you want to cancel this order?
pt: Tens a certeza que queres cancelar este pedido?

# orderCancelReasonLabel
source: Cancellation reason
pt: Motivo do cancelamento

# orderCancelReasonOptionalLabel
source: Reason (optional)
pt: Motivo (opcional)

# orderCancelledSnack
source: Order cancelled. {message}.
pt: Pedido cancelado. {message}.

# orderCancelError
source: Error cancelling order: {error}
pt: Erro ao cancelar pedido: {error}

# noShowReportDialogTitle
source: Report no-show
pt: Reportar no-show

# noShowReportDialogDescription
source: Use this only if the other person didn't show up.
pt: Usa esta opção apenas se a outra pessoa não apareceu.

# noShowReasonOptionalLabel
source: Reason (optional)
pt: Motivo (opcional)

# actionReport
source: Report
pt: Reportar

# noShowReportSuccess
source: No-show reported.
pt: No-show registado.

# noShowReportError
source: Error reporting no-show: {error}
pt: Erro ao reportar no-show: {error}

# orderFinalValueTitle
source: Propose new final value
pt: Propor novo valor final

# orderFinalValueLabel
source: Value
pt: Valor

# orderFinalValueInvalid
source: Enter a valid value.
pt: Insere um valor válido.

# orderFinalValueSent
source: New value sent to the customer.
pt: Novo valor enviado ao cliente.

# orderFinalValueSendError
source: Error sending new value: {error}
pt: Erro ao enviar novo valor: {error}

# ratingSentTitle
source: Rating sent
pt: Avaliação enviada

# ratingProviderTitle
source: Provider rating
pt: Avaliação do prestador

# ratingPrompt
source: Leave a rating from 1 to 5.
pt: Deixa uma nota de 1 a 5.

# ratingCommentLabel
source: Comment (optional)
pt: Comentário (opcional)

# ratingSendAction
source: Send rating
pt: Enviar avaliação

# ratingSelectError
source: Choose a rating.
pt: Escolhe uma nota.

# ratingSentSnack
source: Rating sent.
pt: Avaliação enviada.

# ratingSendError
source: Error sending rating: {error}
pt: Erro ao enviar avaliação: {error}

# timelineCreated
source: Created
pt: Criado

# timelineAccepted
source: Accepted
pt: Aceito

# timelineInProgress
source: In progress
pt: Em andamento

# timelineCancelled
source: Cancelled
pt: Cancelado

# timelineCompleted
source: Completed
pt: Concluído

# lookingForProviderBanner
source: We're still looking for a provider for this order.
pt: Ainda estamos a procurar um prestador para este pedido.

# actionView
source: View
pt: Ver

# chatNoMessagesSubtitle
source: No messages yet
pt: Sem mensagens ainda

# chatMessageCount
source: {count, plural, one{1 message} other{{count} messages}}
pt: {count, plural, one{1 mensagem} other{{count} mensagens}}

# actionClose
source: Close
pt: Fechar

# actionOpen
source: Open
pt: Abrir

# chatAuthRequired
source: You need to be authenticated to send messages.
pt: Precisas estar autenticado para enviar mensagens.

# chatSendError
source: Error sending message: {error}
pt: Erro ao enviar mensagem: {error}

# todayLabel
source: Today
pt: Hoje

# yesterdayLabel
source: Yesterday
pt: Ontem

# chatLoadError
source: Error loading messages: {error}
pt: Erro ao carregar mensagens: {error}

# chatEmptyMessage
source: No messages yet. Send the first one!
pt: Ainda não há mensagens. Envia a primeira!

# chatInputHint
source: Write a message...
pt: Escreve uma mensagem...

# chatLoginHint
source: Sign in to send messages
pt: Inicia sessão para enviar mensagens

# roleLabelSystem
source: System
pt: Sistema

# youLabel
source: You
pt: Tu

# mapOpenAction
source: Open map
pt: Abrir mapa

# orderMapTitle
source: Order map
pt: Mapa do pedido

# orderChatTitle
source: Chat about this order
pt: Chat sobre este pedido

# messagesTitle
source: Messages
pt: Mensagens

# messagesSearchHint
source: Search messages
pt: Pesquisar mensagens

# messagesLoadError
source: Error loading conversations: {error}
pt: Erro ao carregar conversas: {error}

# messagesEmpty
source: You don't have any conversations yet. Once you chat with a provider/customer, they'll appear here.
pt: Ainda não tens conversas. Quando falares com um prestador/cliente, aparece aqui.

# chatPresenceLastSeenAt
source: last seen at {time}
pt: visto por último às {time}

# chatPresenceLastSeenYesterdayAt
source: last seen yesterday at {time}
pt: visto por último ontem às {time}

# chatPresenceLastSeenOn
source: last seen on {date} at {time}
pt: visto por último em {date} às {time}

# chatImageTooLarge
source: Image too large (max 15MB).
pt: Imagem muito grande (máx. 15MB).

# chatImageSendError
source: Error sending image: {error}
pt: Erro ao enviar imagem: {error}

# chatFileReadError
source: Couldn't read the file.
pt: Não consegui ler o ficheiro.

# chatFileTooLarge
source: File too large (max 20MB).
pt: Ficheiro muito grande (máx. 20MB).

# chatFileSendError
source: Error sending file: {error}
pt: Erro ao enviar ficheiro: {error}

# chatAudioReadError
source: Couldn't read the audio.
pt: Não consegui ler o áudio.

# chatAudioTooLarge
source: Audio too large (max 20MB).
pt: Áudio muito grande (máx. 20MB).

# chatAudioSendError
source: Error sending audio: {error}
pt: Erro ao enviar áudio: {error}

# chatAttachFile
source: Send file
pt: Enviar ficheiro

# chatAttachGallery
source: Send photo (gallery)
pt: Enviar foto (galeria)

# chatAttachCamera
source: Take photo (camera)
pt: Tirar foto (câmara)

# chatAttachAudio
source: Send audio (file)
pt: Enviar áudio (ficheiro)

# chatAttachAudioSubtitle
source: Choose an audio file (mp3/m4a/wav/...).
pt: Escolhe um áudio (mp3/m4a/wav/...).

# chatOpenLink
source: Open link
pt: Abrir link

# chatAttachTooltip
source: Attach
pt: Anexar

# chatSendTooltip
source: Send
pt: Enviar

# chatSearchAction
source: Search
pt: Pesquisar

# chatSearchHint
source: Search messages
pt: Pesquisar mensagens

# chatSearchEmpty
source: Type something to search.
pt: Escreve algo para pesquisar.

# chatSearchNoResults
source: No messages found.
pt: Nenhuma mensagem encontrada.

# chatMediaAction
source: Media, links and files
pt: Mídia, links e arquivos

# chatMediaTitle
source: Media, links and files
pt: Mídia, links e arquivos

# chatMediaPhotosTab
source: Photos
pt: Fotos

# chatMediaAudioTab
source: Audio
pt: Áudios

# chatMediaFilesTab
source: Files
pt: Arquivos

# chatMediaEmptyPhotos
source: No photos yet.
pt: Sem fotos ainda.

# chatMediaEmptyLinks
source: No links yet.
pt: Sem links ainda.

# chatMediaEmptyAudio
source: No audio yet.
pt: Sem áudios ainda.

# chatMediaEmptyFiles
source: No files yet.
pt: Sem arquivos ainda.

# chatFavoritesAction
source: Starred
pt: Favoritos

# chatFavoritesTitle
source: Starred messages
pt: Mensagens favoritas

# chatFavoritesEmpty
source: You have no starred messages yet.
pt: Ainda não tens mensagens favoritas.

# chatStarAction
source: Add to favorites
pt: Adicionar aos favoritos

# chatUnstarAction
source: Remove from favorites
pt: Remover dos favoritos

# chatViewProviderProfileAction
source: View provider profile
pt: Ver perfil do prestador

# chatViewCustomerProfileAction
source: View customer profile
pt: Ver perfil do cliente

# chatIncomingCall
source: Incoming call
pt: Chamada a entrar

# chatCallStartedVideo
source: Video call started
pt: Videochamada iniciada

# chatCallStartedVoice
source: Voice call started
pt: Chamada de voz iniciada

# chatImageLabel
source: Image
pt: Imagem

# chatAudioLabel
source: Audio
pt: Áudio

# chatFileLabel
source: File
pt: Ficheiro

# chatCallEntryLabel
source: Call
pt: Chamada

# chatNoSession
source: No active session. Sign in to access the chat.
pt: Sem sessão ativa. Faz login para aceder ao chat.

# chatVideoCallAction
source: Video call
pt: Videochamada

# chatVoiceCallAction
source: Call
pt: Chamada

# chatMarkReadAction
source: Mark as read
pt: Marcar como lidas

# chatCallMissingParticipant
source: The other participant isn't assigned to this order yet.
pt: Ainda não há outro utilizador neste pedido.

# chatCallStartError
source: Couldn't start the call.
pt: Não foi possível abrir a chamada.

# chatCallMessageVideo
source: Video call: {url}
pt: Videochamada: {url}

# chatCallMessageVoice
source: Call: {url}
pt: Chamada: {url}

# profileProviderTitle
source: Provider profile
pt: Perfil do prestador

# profileCustomerTitle
source: Customer profile
pt: Perfil do cliente

# profileAboutTitle
source: About
pt: Sobre

# profileLocationTitle
source: Location
pt: Localização

# profileServicesTitle
source: Services
pt: Serviços

# profilePortfolioTitle
source: Portfolio
pt: Portfólio

# chatOpenFullAction
source: Open full chat
pt: Abrir chat completo

# chatOpenFullUnavailable
source: The other participant hasn't been assigned to this order yet.
pt: Ainda não existe outro utilizador associado a este pedido.
