Repository: FilipeJamal/chegaja_v2
Catalog: lib/l10n/app_*.arb
Languages: pt

# appTitle
source: ChegaJa
pt: ChegaJá

# roleSelectorWelcome
source: Welcome to ChegaJa
pt: Bem-vindo ao ChegaJá

# roleSelectorPrompt
source: Choose how you want to use the app:
pt: Escolhe como queres usar o app:

# roleCustomerTitle
source: I'm a customer
pt: Sou cliente

# roleCustomerDescription
source: I want to find service providers near me.
pt: Quero encontrar prestadores de serviço perto de mim.

# roleProviderTitle
source: I'm a provider
pt: Sou prestador

# roleProviderDescription
source: I want to receive customer requests and earn more.
pt: Quero receber pedidos de clientes e ganhar mais.

source: Invalid session.
pt: Sessão inválida.

# paymentsTitle
source: Payments (Stripe)
pt: Pagamentos (Stripe)

# paymentsHeading
source: Receive online payments
pt: Receber pagamentos online

# paymentsDescription
source: To receive payments via the app, you need to create a Stripe account (Connect Express). The onboarding opens in your browser and takes 2–3 minutes.
pt: Para receber pagamentos via app, precisas criar uma conta Stripe (Connect Express). O onboarding abre no teu browser e demora 2–3 minutos.

# paymentsActive
source: Online payments ACTIVE.
pt: Pagamentos online ATIVOS.

# paymentsInactive
source: Online payments are not active yet. Complete onboarding.
pt: Pagamentos ainda não ativos. Faz o onboarding.

# onboardingOpened
source: Onboarding opened. After finishing, come back to check the status.
pt: Onboarding aberto. Depois de concluíres, volta aqui para ver o estado.

# onboardingStartError
source: Error starting onboarding: {error}
pt: Erro ao iniciar onboarding: {error}

source: Manage Stripe account
pt: Gerir conta Stripe

source: Activate payments
pt: Ativar pagamentos

# technicalNotesTitle
source: Technical notes
pt: Notas técnicas

# technicalNotesBody
source: • Stripe is configured via Cloud Functions (server-side). • The platform commission is applied automatically in the PaymentIntent. • In production, add the Stripe webhook and store the webhook secret in Functions.
pt: • O Stripe é configurado via Cloud Functions (server-side). • A comissão da plataforma é aplicada automaticamente no PaymentIntent. • Em produção, adiciona o webhook do Stripe e guarda a webhook secret nas Functions.

# kycTitle
source: Identity verification: {status}
pt: Verificação de identidade: {status}

# kycDescription
source: Send a document (photo or PDF). Full validation comes in v2.6.
pt: Envia um documento (foto ou PDF). A validação completa fica para v2.6.

# kycSendDocument
source: Send document
pt: Enviar documento

# kycAddDocument
source: Add document
pt: Adicionar documento

# kycStatusApproved
source: Approved
pt: Aprovado

# kycStatusRejected
source: Rejected
pt: Rejeitado

# kycStatusInReview
source: In review
pt: Em análise

# kycStatusNotStarted
source: Not started
pt: Não iniciado

# kycFileReadError
source: Could not read the file.
pt: Não consegui ler o ficheiro.

# kycFileTooLarge
source: File too large (max. 10MB).
pt: Ficheiro muito grande (máx. 10MB).

# kycUploading
source: Uploading document...
pt: A enviar documento...

# kycUploadSuccess
source: Document sent for review.
pt: Documento enviado para análise.

# kycUploadError
source: Error sending document: {error}
pt: Erro ao enviar documento: {error}

# statusCancelledByYou
source: Cancelled by you
pt: Cancelado por ti

# statusCancelledByProvider
source: Cancelled by provider
pt: Cancelado pelo prestador

# statusCancelled
source: Cancelled
pt: Cancelado

# statusLookingForProvider
source: Looking for provider
pt: A procurar prestador

# statusProviderPreparingQuote
source: Provider found (preparing quote)
pt: Prestador encontrado (a preparar orçamento)

# statusQuoteToDecide
source: You have a quote to decide
pt: Tens um orçamento para decidir

# statusProviderFound
source: Provider found
pt: Prestador encontrado

# statusServiceInProgress
source: Service in progress
pt: Serviço em andamento

# statusAwaitingValueConfirmation
source: Awaiting your value confirmation
pt: A aguardar tua confirmação de valor

# statusServiceCompleted
source: Service completed
pt: Serviço concluído

source: {value} (to confirm)
pt: {value} (a confirmar)

source: {value} (proposed)
pt: {value} (proposto)

# valueEstimatedRange
source: {min} to {max} (estimated)
pt: {min} a {max} (estimado)

# valueEstimatedFrom
source: From {min} (estimated)
pt: Desde {min} (estimado)

# valueEstimatedUpTo
source: Up to {max} (estimated)
pt: Até {max} (estimado)

# priceFixed
source: Fixed price
pt: Preço fixo

# priceByQuote
source: By quote
pt: Por orçamento

# priceToArrange
source: To be arranged
pt: Preço a combinar

# paymentOnlineBefore
source: Online payment (before)
pt: Pagamento online (antes)

# paymentOnlineAfter
source: Online payment (after)
pt: Pagamento online (depois)

# paymentCash
source: Cash payment
pt: Pagamento em dinheiro

# pendingActionQuoteToReview
source: You have a quote/proposal to review.
pt: Tens um orçamento/proposta para analisar.

# pendingActionValueToConfirm
source: The provider sent the final value. You need to confirm.
pt: O prestador lançou o valor final. Falta confirmares.

# pendingActionProviderPreparingQuote
source: Provider found. They are preparing the quote.
pt: Prestador encontrado. Ele está a preparar o orçamento.

# pendingActionProviderChat
source: Provider found. You can chat with them.
pt: Prestador encontrado. Podes falar com ele no chat.

# roleLabelCustomer
source: Customer
pt: Cliente

# navHome
source: Home
pt: Início

# navMyOrders
source: My Orders
pt: Meus pedidos

# navMessages
source: Messages
pt: Mensagens

# navProfile
source: Profile
pt: Perfil

# homeGreeting
source: Hello
pt: Olá

# homeSubtitle
source: What do you need today?
pt: Do que precisas hoje?

# homePendingTitle
source: You have something to decide
pt: Tens algo para decidir

# homePendingCta
source: Tap here to open the next order and decide.
pt: Toca aqui para abrir o próximo pedido e decidir.

# servicesLoadError
source: Error loading services: {error}
pt: Erro ao carregar serviços: {error}

# servicesEmptyMessage
source: No services configured yet.\nYou'll see categories here soon 🙂
pt: Ainda não há serviços configurados.\nEm breve vais ver aqui categorias para escolher 😉

# availableServicesTitle
source: Available services
pt: Serviços disponíveis

# serviceTabImmediate
source: Immediate
pt: Imediato

# serviceTabScheduled
source: Scheduled
pt: Agendado

# serviceTabQuote
source: By quote
pt: Por orçamento

# unreadMessagesTitle
source: You have new messages
pt: Tens novas mensagens

# unreadMessagesCta
source: Tap here to open the chat.
pt: Toca aqui para abrir o chat.

# serviceSearchHint
source: Search service...
pt: Procurar serviço...

# serviceSearchEmpty
source: No services found for this search.
pt: Não encontrámos serviços para esta pesquisa.

# serviceModeImmediateDescription
source: A provider comes today as quickly as possible.
pt: Um prestador vem já hoje, o mais rápido possível.

# serviceModeScheduledDescription
source: Schedule a day and time for the service.
pt: Marca dia e hora para o serviço.

# serviceModeQuoteDescription
source: Request a quote (provider sends a min/max range).
pt: Pede orçamento (o prestador envia faixa min/max).

# userNotAuthenticatedError
source: Error: user not authenticated.
pt: Erro: utilizador não autenticado.

# myOrdersTitle
source: My orders
pt: Meus pedidos

# ordersTabPending
source: Pending
pt: Pendentes

# ordersTabCompleted
source: Completed
pt: Concluídos

# ordersTabCancelled
source: Cancelled
pt: Cancelados

# ordersLoadError
source: Error loading orders: {error}
pt: Erro a carregar pedidos: {error}

# ordersEmptyPending
source: You have no pending orders.\nCreate a new order from Home.
pt: Não tens pedidos pendentes.\nCria um novo pedido no Início.

# ordersEmptyCompleted
source: You don't have completed orders yet.
pt: Ainda não tens pedidos concluídos.

# ordersEmptyCancelled
source: You don't have cancelled orders yet.
pt: Ainda não tens pedidos cancelados.

# orderQuoteScheduled
source: Quote (scheduled)
pt: Orçamento (agendado)

# orderQuoteImmediate
source: Quote (immediate)
pt: Orçamento (imediato)

# orderScheduled
source: Scheduled service
pt: Serviço agendado

# orderImmediate
source: Immediate service
pt: Serviço imediato

source: Category not defined
pt: Categoria não definida

# orderStateLabel
source: State: {state}
pt: Estado: {state}

# orderPriceModelLabel
source: Price model: {model}
pt: Modelo de preço: {model}

# orderPaymentLabel
source: Payment: {payment}
pt: Pagamento: {payment}

# orderValueLabel
source: Value: {value}
pt: Valor: {value}

# accountTitle
source: Account ({role})
pt: Conta ({role})

# accountNameTitle
source: Your name
pt: O teu nome

# accountProfileSubtitle
source: Profile
pt: Perfil

# accountSettings
source: Settings
pt: Definições

# accountHelpSupport
source: Help and support
pt: Ajuda e suporte

# navMyJobs
source: My Jobs
pt: Meus trabalhos

# roleLabelProvider
source: Provider
pt: Prestador

source: Enable location to go online.
pt: Ativa a localização para ficar online.

# nearbyOrdersTitle
source: Orders near you
pt: Pedidos perto de ti

# noOrdersAvailableMessage
source: No orders available right now.
pt: Não há pedidos disponíveis agora.

# configureServiceAreaMessage
source: Set your service area and services to start receiving orders.
pt: Configura a tua área e serviços para começar a receber pedidos.

# configureAction
source: Configure
pt: Configurar

# offlineEnableOnlineMessage
source: You're offline. Enable online status to receive orders.
pt: Estás offline. Fica online para receber pedidos.

# noMatchingOrdersMessage
source: No matching orders for your services and area.
pt: Sem pedidos compatíveis com os teus serviços e área.

# orderAcceptedMessage
source: Order accepted.
pt: Pedido aceite.

# orderAcceptedCanSendQuote
source: Order accepted. You can send the quote later.
pt: Pedido aceite. Podes enviar o orçamento mais tarde.

# orderAcceptError
source: Error accepting order: {error}
pt: Erro ao aceitar pedido: {error}

# orderAcceptedDialogTitle
source: Order accepted
pt: Pedido aceite

# orderAcceptedBudgetPrompt
source: This order is by quote.\n\nDo you want to send the quote range now?
pt: Este pedido é por orçamento.\n\nQueres enviar o orçamento (faixa min/max) agora?

# actionLater
source: Later
pt: Mais tarde

# actionSendNow
source: Send now
pt: Enviar agora

# actionCancel
source: Cancel
pt: Cancelar

# actionSend
source: Send
pt: Enviar

# actionIgnore
source: Ignore
pt: Ignorar

# actionAccept
source: Accept
pt: Aceitar

# actionNo
source: No
pt: Não

# actionYesCancel
source: Yes, cancel
pt: Sim, cancelar

# proposalDialogTitle
source: Send a quote
pt: Propor serviço

# proposalDialogDescription
source: Set a price range for this service.\nInclude travel and labor.
pt: Define uma faixa de preço para este serviço.\nInclui deslocação e mão de obra.

# proposalMinValueLabel
source: Minimum value ({currency})
pt: Valor mínimo ({currency})

# proposalMaxValueLabel
source: Maximum value ({currency})
pt: Valor máximo ({currency})

# proposalMessageLabel
source: Message to the customer (optional)
pt: Mensagem para o cliente (opcional)

# proposalMessageHint
source: Ex.: Includes travel. Large materials are extra.
pt: Ex.: Inclui deslocação. Materiais grandes à parte.

# proposalInvalidValues
source: Enter valid minimum and maximum values.
pt: Preenche valores mínimo e máximo válidos.

# proposalMinGreaterThanMax
source: The minimum can't be greater than the maximum.
pt: O mínimo não pode ser maior que o máximo.

# proposalSent
source: Proposal sent to the customer.
pt: Proposta enviada ao cliente.

# proposalSendError
source: Error sending proposal: {error}
pt: Erro ao enviar proposta: {error}

# providerHomeGreeting
source: Hello, provider
pt: Olá, prestador

# providerHomeSubtitle
source: Go online to receive new orders.
pt: Fica online para receber novos pedidos.

# providerStatusOnline
source: You're ONLINE
pt: Estás ONLINE

# providerStatusOffline
source: You're OFFLINE
pt: Estás OFFLINE

# providerKpiEarningsToday
source: Earnings today (net)
pt: Ganhos hoje (líquido)

# providerKpiServicesThisMonth
source: Services this month
pt: Serviços este mês

# providerKpiGrossFeeSubtitle
source: Gross: {gross} - Fee: {fee}
pt: Bruto: {gross} - Taxa: {fee}

# providerHighlightTitle
source: You have a job to manage
pt: Tens um trabalho para gerir

# providerHighlightCta
source: Tap here to open the next job.
pt: Toca aqui para abrir o próximo trabalho.

# providerPendingActionAccepted
source: You have an accepted job, ready to start.
pt: Tens um trabalho aceite, pronto para iniciar.

# providerPendingActionInProgress
source: You have a job in progress. Mark it completed when you finish.
pt: Tens um serviço em andamento. Marca como concluído quando terminares.

# providerPendingActionSetFinalValue
source: Set and send the final service value.
pt: Define e envia o valor final do serviço.

# providerUnreadMessagesTitle
source: You have new messages from customers
pt: Tens novas mensagens de clientes

# providerUnreadMessagesJob
source: In job: {jobTitle}
pt: No trabalho: {jobTitle}

# providerJobsTitle
source: My jobs
pt: Meus trabalhos

# providerJobsTabOpen
source: Open
pt: Em aberto

# providerJobsTabCompleted
source: Completed
pt: Concluídos

# providerJobsTabCancelled
source: Cancelled
pt: Cancelados

# providerJobsLoadError
source: Error loading jobs: {error}
pt: Erro a carregar trabalhos: {error}

# providerJobsEmptyOpen
source: You don't have open jobs yet.\nGo to Home and accept an order.
pt: Ainda não tens trabalhos em aberto.\nVai à aba Início e aceita um pedido.

# providerJobsEmptyCompleted
source: You don't have completed jobs yet.
pt: Ainda não tens trabalhos concluídos.

# providerJobsEmptyCancelled
source: You don't have cancelled jobs yet.
pt: Ainda não tens trabalhos cancelados.

# scheduledForDate
source: Scheduled: {date}
pt: Agendado: {date}

# viewDetailsTooltip
source: View details
pt: Ver detalhe

# clientPaidValueLabel
source: Customer paid: {value}
pt: Valor pago pelo cliente: {value}

# providerEarningsFeeLabel
source: You receive: {value} - Fee: {fee}
pt: Tu recebes: {value} - Taxa: {fee}

# serviceValueLabel
source: Service value: {value}
pt: Valor do serviço: {value}

# cancelJobTitle
source: Cancel job
pt: Cancelar trabalho

# cancelJobPrompt
source: Are you sure you want to cancel this job?\nThe order may become available to other providers.
pt: Tens a certeza que queres cancelar este trabalho?\nO pedido pode voltar a ficar disponível para outros prestadores.

# cancelJobReasonLabel
source: Cancellation reason (optional):
pt: Motivo do cancelamento (opcional):

# cancelJobReasonFieldLabel
source: Reason
pt: Motivo

# cancelJobSuccess
source: Job cancelled.
pt: Trabalho cancelado.

# cancelJobError
source: Error cancelling job: {error}
pt: Erro ao cancelar trabalho: {error}

# providerAccountProfileTitle
source: View my profile
pt: Ver o meu perfil

# providerAccountProfileSubtitle
source: Provider profile
pt: Perfil de Prestador

# activateOnlinePaymentsSubtitle
source: Enable online payments
pt: Ativar recebimentos online

# statusProviderWaiting
source: New request
pt: Novo pedido

# statusQuoteWaitingCustomer
source: Waiting for customer response
pt: Aguarda resposta do cliente

# statusAcceptedToStart
source: Accepted (ready to start)
pt: Aceite (pronto a iniciar)

# statusInProgress
source: In progress
pt: Em andamento

# statusCompleted
source: Completed
pt: Concluído

# orderDefaultImmediateTitle
source: Urgent service
pt: Serviço urgente

# locationServiceDisabled
source: Location service is disabled on the device.
pt: O serviço de localização está desativado no dispositivo.

# locationPermissionDenied
source: Location permission denied.\nCouldn't get the current location.
pt: Permissão de localização negada.\nNão foi possível obter a localização atual.

# locationPermissionDeniedForever
source: Location permission permanently denied.\nEnable location in device settings.
pt: Permissão de localização negada permanentemente.\nAtiva a localização nas definições do dispositivo.

# locationFetchError
source: Error getting location: {error}
pt: Erro ao obter localização: {error}

# formNotReadyError
source: The form isn't ready yet. Try again.
pt: O formulário ainda não está pronto. Tenta novamente.

# missingRequiredFieldsError
source: Required fields are missing. Check the fields in red.
pt: Faltam campos obrigatórios. Verifica os campos em vermelho.

# scheduleDateTimeRequiredError
source: Choose the service date and time.
pt: Escolhe a data e hora do serviço.

# scheduleDateTimeFutureError
source: Choose a future date/time.
pt: Escolhe uma data/hora no futuro.

# categoryRequiredError
source: Choose a category.
pt: Escolhe uma categoria.

# orderUpdatedSuccess
source: Order updated successfully!
pt: Pedido atualizado com sucesso!

# orderCreatedSuccess
source: Order created! Looking for a provider...
pt: Pedido criado! A procurar um prestador...

# orderUpdateError
source: Error updating order: {error}
pt: Erro ao atualizar pedido: {error}

# orderCreateError
source: Error creating order: {error}
pt: Erro ao criar pedido: {error}

# orderTitleExamplePlumbing
source: Ex.: Plumbing leak under the sink
pt: Ex.: Canalização a verter debaixo do lava-louça

# orderTitleExampleElectric
source: Ex.: Outlet doesn't work in the living room + install ceiling light
pt: Ex.: Tomada não funciona na sala + ligar candeeiro de teto

# orderTitleExampleCleaning
source: Ex.: Full cleaning of a 2-bedroom apartment (kitchen, WC, windows, floor).
pt: Ex.: Limpeza completa de apartamento T2 (cozinha, WC, janelas e chão).

# orderTitleHintImmediate
source: Briefly explain what's happening and what you need.
pt: Explica rapidamente o que está a acontecer e o que precisas.

# orderTitleHintScheduled
source: Say when you want the service, location details, and what needs to be done.
pt: Indica para quando queres o serviço, detalhes do local e o que deve ser feito.

# orderTitleHintQuote
source: Describe the service you want to receive proposals for.
pt: Descreve o serviço desejado para receber propostas.

# orderTitleHintDefault
source: Describe the service you need.
pt: Descreve o serviço que precisas.

# orderDescriptionExampleCleaning
source: Ex.: Full cleaning of a 2-bedroom apartment (kitchen, WC, windows, floor).
pt: Ex.: Limpeza completa de apartamento T2 (cozinha, WC, janelas e chão).

# orderDescriptionHintImmediate
source: Briefly explain what's happening and what you need.
pt: Explica rapidamente o que está a acontecer e o que precisas.

# orderDescriptionHintScheduled
source: Say when you want the service, location details, and what needs to be done.
pt: Indica para quando queres o serviço, detalhes do local e o que deve ser feito.

# orderDescriptionHintQuote
source: Describe the service you want, approximate budget (if you have one), and important details.
pt: Descreve o serviço desejado, orçamento aproximado (se tiveres) e detalhes importantes.

# orderDescriptionHintDefault
source: Explain in a bit more detail what you need.
pt: Explica com algum detalhe o que precisas.

# priceModelTitle
source: Price model
pt: Modelo de preço

# priceModelQuoteInfo
source: This service is by quote. The provider will propose the final price.
pt: Este serviço é por orçamento. O prestador vai propor o valor final.

# priceTypeLabel
source: Price type
pt: Tipo de preço

# paymentTypeLabel
source: Payment type
pt: Tipo de pagamento

# orderHeaderQuoteTitle
source: Quote request
pt: Pedido por orçamento

# orderHeaderQuoteSubtitle
source: Describe what you need and the provider can send a range (min/max).
pt: Descreve o que precisas e o prestador pode enviar uma faixa (mín/máx).

# orderHeaderImmediateTitle
source: Immediate service
pt: Serviço imediato

# orderHeaderImmediateSubtitle
source: An available provider will be called as soon as possible.
pt: Um prestador disponível será chamado o mais rápido possível.

# orderHeaderScheduledTitle
source: Scheduled service
pt: Serviço por agendamento

# orderHeaderScheduledSubtitle
source: Choose the day and time for the provider to come to you.
pt: Escolhe o dia e hora para o prestador ir até ti.

# orderHeaderDefaultTitle
source: New order
pt: Novo pedido

# orderHeaderDefaultSubtitle
source: Describe the service you need.
pt: Descreve o serviço que precisas.

# orderEditTitle
source: Edit order
pt: Editar pedido

# orderNewTitle
source: New order
pt: Novo pedido

# whenServiceNeededLabel
source: When do you need the service?
pt: Quando precisas do serviço?

# categoryLabel
source: Category
pt: Categoria

# categoryHint
source: Choose the service category
pt: Escolhe a categoria do serviço

# orderTitleLabel
source: Order title
pt: Título do pedido

# orderTitleRequiredError
source: Write a title for the order.
pt: Escreve um título para o pedido.

# orderDescriptionOptionalLabel
source: Description (optional)
pt: Descrição (opcional)

# locationApproxLabel
source: Approximate location
pt: Localização aproximada

# locationSelectedLabel
source: Location selected.
pt: Localização selecionada.

# locationSelectPrompt
source: Choose where the service will be performed (approximate).
pt: Escolhe onde o serviço será feito (aproximado).

# locationAddressHint
source: Street, number, floor, reference (optional, but helps a lot)
pt: Rua, nº, andar, referência (opcional, mas ajuda muito)

# locationGetting
source: Getting location...
pt: A obter localização...

# locationUseCurrent
source: Use current location
pt: Usar localização atual

# locationChooseOnMap
source: Choose on map
pt: Escolher no mapa

# serviceDateTimeLabel
source: Service date and time
pt: Data e hora do serviço

# serviceDateTimePick
source: Choose day and time
pt: Escolhe dia e hora

# saveChangesButton
source: Save changes
pt: Guardar alterações

# submitOrderButton
source: Request service
pt: Pedir serviço

# mapSelectTitle
source: Choose location on map
pt: Escolher localização no mapa

# mapSelectInstruction
source: Drag the map to the approximate service location, then confirm.
pt: Arrasta o mapa até ao local aproximado do serviço, depois confirma.

# mapSelectConfirm
source: Confirm location
pt: Confirmar localização

# orderDetailsTitle
source: Order details
pt: Detalhe do pedido

# orderLoadError
source: Error loading order: {error}
pt: Erro a carregar pedido: {error}

source: Order not found.
pt: Pedido não encontrado.

# scheduledNoDate
source: Scheduled (no date set)
pt: Agendado (sem data definida)

# orderValueRejectedTitle
source: The customer rejected the proposed value.
pt: O cliente rejeitou o valor proposto.

# orderValueRejectedBody
source: Chat with the customer and propose a new value when aligned.
pt: Conversem pelo chat e propõe um novo valor quando estiverem alinhados.

# actionProposeNewValue
source: Propose new value
pt: Propor novo valor

# noShowReportedTitle
source: No-show reported
pt: No-show reportado

# noShowReportedBy
source: Reported by: {role}
pt: Reportado por: {role}

# noShowReportedAt
source: At: {date}
pt: Em: {date}

# noShowDescription
source: If the other person didn't show up, you can report it.
pt: Se a outra pessoa não apareceu, podes reportar.

# noShowReportAction
source: Report no-show
pt: Reportar no-show

# orderInfoTitle
source: Order information
pt: Informações do pedido

# orderInfoIdLabel
source: Order ID
pt: ID do pedido

# orderInfoCreatedAtLabel
source: Created at
pt: Criado em

# orderInfoStatusLabel
source: Status
pt: Estado

# orderInfoModeLabel
source: Mode
pt: Modo

# orderInfoValueLabel
source: Value
pt: Valor

# orderLocationTitle
source: Order location
pt: Localização do pedido

# orderDescriptionTitle
source: Order description
pt: Descrição do pedido
